# Intersect Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Face..::..Intersect Method
Face Class See Also
---
Calculates the intersection of the specified curve with this face.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Intersect(Curve) | Calculates the intersection of the specified curve with this face. |
| Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results. |
| Intersect(Curve, IntersectionResultArray%) | Calculates the intersection of the specified curve with this face and returns the intersection results. |
| Intersect(Face, Curve%) | Calculates the intersection of the specified face with this face and returns the intersection results. |

# See Also
Face Class
Face Members
Autodesk.Revit.DB Namespace